{
  "posts": [
    {
      "id": "free-cloudsite-plan-end-of-life",
      "date": "June 3rd, 2021",
      "title": "Free Cloudsite Plan End of Life",
      "img": "https://raw.githubusercontent.com/GearHost/blog/master/posts/media/free-cloudsite-plan-end-of-life/header.jpg",
      "summary": "Today we are announcing the end of the free CloudSite plan. As of today June 3rd, 2021 the free CloudSite plan will be removed from the GearHost Portal. For now, any existing free CloudSites will stay active for at least 30 days. 30 days from today all customers that do not have a paid service will lose their free CloudSite whether its actively used or not."
    },
    {
      "id": "may-2019-intel-vulnerability",
      "date": "February 14th, 2019",
      "title": "A Message About Intel's Microarchitectural Data Sampling (MDS) Vulnerability",
      "img": "https://raw.githubusercontent.com/GearHost/blog/master/posts/media/may-2019-intel-vulnerability/header.png",
      "summary": "Today, Intel released a statement regarding Microarchitectural Data Sampling (MDS) - also referred to as ZombieLoad - a significant security vulnerability that affects cloud providers with multi-tenant environments, including GearHost. Left unmitigated, this vulnerability could allow sophisticated attackers to gain access to sensitive data, secrets, and credentials that could allow for privilege escalation and unauthorized access to user data."
    },
    {
      "id": "lets-encrypt",
      "date": "February 16th, 2017",
      "title": "Introducting Let's Encrypt Certs",
      "img": "https://raw.githubusercontent.com/GearHost/blog/master/posts/media/lets-encrypt/header.png",
      "summary": "Hooray! After much feedback Let's Encrypt support is now public and available on all Hobby and up CloudSite applications! Let's Encrypt is a little different than most SSL certificate providers. For starters it's free! Launched in April 2016 Let's Encrypt offers free X.509 certificates via an automated process designed to eliminate the current complex process of manual creation, validation, signing, installation, and renewal of certificates for secure websites."
    },
    {
      "id": "bitcoin-payments-welcome",
      "date": "August 1st, 2016",
      "dateUpdated": "2016-08-01T12:00:00Z",
      "title": "Bitcoin Payments Welcome",
      "img": "https://raw.githubusercontent.com/GearHost/blog/master/posts/media/bitcoin-payments-welcome/header.png",
      "summary": "We are excited to be part of the growing bitcoin community! Through our partnership with Coinbase, GearHost now accepts bitcoin payments for cloud hosting services! This is in combination with our already existing credit card and PayPal payments."
    },
    {
      "id": "new-free-plan-released",
      "date": "April 23, 2015",
      "dateUpdated": "2015-04-23T12:00:00Z",
      "title": "New Free Plan Released",
      "img": "https://raw.githubusercontent.com/GearHost/blog/master/posts/media/new-free-plan-released/header.png",
      "summary": "We're happy to announce the release of our all new Free CloudSite plan. This plan boasts a ton of new features and improvements making it bigger, better, faster and also gluten free. But why the change? Let's get into the thought process behind that, how we designed the new plan, what it has to offer and how it affects you."
    },
    {
      "id": "making-a-homegrown-blog",
      "date": "April 15, 2015",
      "dateUpdated": "2015-04-15T12:00:00Z",
      "title": "Making a Homegrown Blog",
      "img": "https://raw.githubusercontent.com/GearHost/blog/master/posts/media/making-a-homegrown-blog/header.png",
      "summary": "At GearHost things are moving faster than ever. In an effort to keep more in touch with you and keeping GearHost transparent we've built a pretty simply yet snazzy blog platform. Instead of writing our first blog post about it being just that, our first blog post (boring!), I figured it could be about how we build this blog platform (that's cool!)."
    }
  ]
}
